jaowens14/DeltaTPlus_STM32WB55RG_0925/DeltaTPlus_STM32WB55RG_090525/Core/Src/main.cpp
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "dma.h"
#include "i2c.h"
#include "ipcc.h"
#include "memorymap.h"
#include "rf.h"
#include "rtc.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "usb_device.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
// #include "Adafruit_GFX.h"
//  #include "usbd_cdc_if.h"
#include "stm32_seq.h"

// #include "ST7789V_STM32.h"
// #include "Screen.hpp"
#include "Accelerometer.hpp"
#include "Backlight.hpp"
#include "Thermocouples.hpp"
#include "DeltaT.h"
#include "screen.h"
#include "BatteryMonitor.h"
#include "Touch.hpp"
#include "FT5436_Touch.h"
#define LV_LVGL_H_INCLUDE_SIMPLE

#define WEB_LIGHT_TAN 0xf0ead0
#define WEB_BLACK 0x382922
#define WEB_ORANGE 0xdf571d
#define Charcoal 0x36454F

#define HEADER_HEIGHT 32
#define LABEL_HEIGHT 64
#define METER_HEIGHT (320 - LABEL_HEIGHT - HEADER_HEIGHT)

#include <math.h>

#include "lvgl.h"
#include "src/misc/lv_math.h"
#include "src/others/snapshot/lv_snapshot.h"
#include "ST7789.h"
// #include "lv_port_disp.h"
// #include "examples/anim/lv_example_anim.h"
// #include "examples/widgets/arclabel/lv_example_arclabel.h"
// #include "examples/anim/lv_example_anim.h"
// #include "AD7124/ad7124_console_app.h"
// #include "ad7124_console_app.h"
// #include "ad7124.h"
// #include "ad7124_regs.h"
/* USER CODE END Includes */

// Global pointer to update the meter value
static lv_obj_t *meter_needle = NULL;
static lv_obj_t *meter_value_label = NULL;
static lv_obj_t *meter_arc = NULL;
static lv_draw_buf_t *snapshot = NULL;

static lv_obj_t *settingLabel = NULL;
static lv_obj_t *batteryLabel = NULL;
static lv_obj_t *needle = NULL;
static lv_obj_t *tickMarks = NULL;
static lv_obj_t *scr = NULL;
static lv_obj_t *needle_line = NULL;

int needleLength = 80;
const int needleOriginX = ST7789_WIDTH / 2;
const int needleOriginY = ST7789_HEIGHT / 2;

int meter_angle;
int meter_angle_width;
int angle;
int min_angle = -60; // zero is vertical i think
int max_angle = 60;
int lastAngle;
uint32_t lv_delay = 0;

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
uint8_t UART_BUFFER[128] = {0};
#define BYTE_PER_PIXEL 2
lv_display_t *display1 = NULL; // Global variable

static uint8_t buffer1[ST7789_WIDTH * ST7789_HEIGHT / 4 * BYTE_PER_PIXEL];
static uint8_t buffer2[ST7789_WIDTH * ST7789_HEIGHT / 4 * BYTE_PER_PIXEL];

// static uint8_t buffer2[ST7789_WIDTH * ST7789_HEIGHT / 32 * BYTE_PER_PIXEL];

/* USER CODE END PTD */
/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
// static struct ad7124_dev *pAd7124_dev = NULL;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
volatile int timerCounter = 0;
volatile uint32_t loopCounter = 0;
volatile uint32_t loopsPerSecond = 0;
volatile uint8_t measureFlag = 0;
Accelerometer myAccelerometer;
Backlight myBacklight;
Thermocouples myThermocouples;
// Screen myScreen;
Touch myTouch;

///////////////////////////////////////////////////

int32_t get_cos(int32_t deg, int32_t a)
{
  int32_t r = (lv_trigo_cos(deg) * a);

  r += LV_TRIGO_SIN_MAX / 2;
  return r >> LV_TRIGO_SHIFT;
}

int32_t get_sin(int32_t deg, int32_t a)
{
  int32_t r = lv_trigo_sin(deg) * a;

  return (r + LV_TRIGO_SIN_MAX / 2) >> LV_TRIGO_SHIFT;
}

/* Timer callback to update the text area with sensor data */
static void updateSettingLabel(lv_timer_t *timer)
{
  char *switchState;

  if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_0))
  {
    switchState = "HIGH";
    Thermocouples::userGain = 2.0;
  }
  else
  {
    switchState = "LOW";
    Thermocouples::userGain = 1.0;
  }

  lv_obj_t *ta = (lv_obj_t *)lv_timer_get_user_data(timer);

  char buf[32];
  snprintf(buf, sizeof(buf), "%s", switchState);

  lv_label_set_text(ta, buf);
}

static void updateBatteryLabel(lv_timer_t *timer)
{
  int batteryLevel = getChargeLevel();

  lv_obj_t *ta = (lv_obj_t *)lv_timer_get_user_data(timer);

  char buf[32];
  snprintf(buf, sizeof(buf), "%d%%", batteryLevel);

  lv_label_set_text(ta, buf);
}

static void updateNeedle(lv_timer_t *timer)
{

  angle = int(myThermocouples.deltaTemp);

  if (angle < min_angle)
    angle = min_angle;
  if (angle > max_angle)
    angle = max_angle;

  if (angle != lastAngle)
  {

    lastAngle = angle;

    static lv_point_precise_t needle_points[2];
    needle_points[0].x = needleOriginX;
    needle_points[0].y = needleOriginY;
    // Use needleLength (80) and keep precision by not casting to int early
    needle_points[1].x = needleOriginX + get_sin(angle, needleLength);
    needle_points[1].y = needleOriginY - get_cos(angle, needleLength);
    // Negative because Y increases downward

    lv_line_set_points(needle, needle_points, 2);
  }
}

static void set_needle_line_value(void *obj, int32_t v)
{
  lv_scale_set_line_needle_value((lv_obj_t *)obj, needle_line, 60, v);
}

void lv_example_scale_3_line_only(void)
{
  // 1. Create the Scale Widget
  lv_obj_t *scale_line = lv_scale_create(lv_screen_active());

  // 2. Configure Appearance and Geometry
  lv_obj_set_size(scale_line, 150, 150);
  lv_scale_set_mode(scale_line, LV_SCALE_MODE_ROUND_INNER);
  lv_obj_set_style_bg_opa(scale_line, LV_OPA_COVER, 0);
  lv_obj_set_style_bg_color(scale_line, lv_palette_lighten(LV_PALETTE_RED, 5), 0);
  lv_obj_set_style_radius(scale_line, LV_RADIUS_CIRCLE, 0);
  lv_obj_set_style_clip_corner(scale_line, true, 0);
  lv_obj_align(scale_line, LV_ALIGN_CENTER, 0, 0); // Aligned to center for a single widget example

  // 3. Configure Scale Ticks and Range
  lv_scale_set_label_show(scale_line, true);
  lv_scale_set_total_tick_count(scale_line, 31);
  lv_scale_set_major_tick_every(scale_line, 5);
  lv_obj_set_style_length(scale_line, 5, LV_PART_ITEMS);
  lv_obj_set_style_length(scale_line, 10, LV_PART_INDICATOR);
  lv_scale_set_range(scale_line, 10, 40);

  // 4. Configure Scale Arc
  lv_scale_set_angle_range(scale_line, 270);
  lv_scale_set_rotation(scale_line, 135);

  // 5. Create the Line Needle Object
  needle_line = lv_line_create(scale_line);
  lv_obj_set_style_line_width(needle_line, 6, LV_PART_MAIN);
  lv_obj_set_style_line_rounded(needle_line, true, LV_PART_MAIN);

  // 6. Set up and Start Animation
  lv_anim_t anim_scale_line;
  lv_anim_init(&anim_scale_line);
  lv_anim_set_var(&anim_scale_line, scale_line);
  lv_anim_set_exec_cb(&anim_scale_line, set_needle_line_value);
  lv_anim_set_duration(&anim_scale_line, 1000);
  lv_anim_set_repeat_count(&anim_scale_line, LV_ANIM_REPEAT_INFINITE);
  lv_anim_set_reverse_duration(&anim_scale_line, 1000);
  lv_anim_set_values(&anim_scale_line, 10, 40);
  lv_anim_start(&anim_scale_line);
}

void brookes_meter(void)
{

  // root widget / base screen - tan, no features
  lv_obj_t *scr = lv_scr_act();

