jaowens14/DeltaTPlus_STM32WB55RG_0925/DeltaTPlus_STM32WB55RG_090525/Core/Src/main.cpp
  lv_obj_clear_flag(scr, LV_OBJ_FLAG_CLICKABLE);
  lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_border_width(scr, 0, 0);
  lv_obj_set_style_pad_all(scr, 0, 0);
  lv_obj_set_style_bg_color(scr, lv_color_hex(WEB_LIGHT_TAN), 0);

#if 0

  // --- START STATIC SCALE PRE-RENDERING ---
  // 1. Create temporary container for rendering
  lv_obj_t *temp_cont = lv_obj_create(scr);
  // Use the maximum necessary size/position to capture the full scale and its labels
  lv_obj_set_size(temp_cont, ST7789_WIDTH, ST7789_HEIGHT);
  lv_obj_set_pos(temp_cont, 0, 0);
  lv_obj_set_style_bg_color(temp_cont, lv_color_hex(WEB_LIGHT_TAN), 0);
  lv_obj_set_style_border_width(temp_cont, 0, 0);
  lv_obj_set_style_radius(temp_cont, 0, 0);
  lv_obj_clear_flag(temp_cont, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_clear_flag(temp_cont, LV_OBJ_FLAG_CLICKABLE);

  // 2. Create the scale object as a child of the temporary container
  tickMarks = lv_scale_create(temp_cont);
  lv_obj_clear_flag(tickMarks, LV_OBJ_FLAG_CLICKABLE);
  lv_obj_clear_flag(tickMarks, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_add_flag(tickMarks, LV_OBJ_FLAG_IGNORE_LAYOUT);
  lv_obj_set_style_line_opa(tickMarks, LV_OPA_COVER, LV_PART_ITEMS);
  lv_obj_set_style_opa(tickMarks, LV_OPA_COVER, 0);
  lv_obj_set_size(tickMarks, 400, 400);
  lv_obj_align(tickMarks, LV_ALIGN_CENTER, 0, 100); // Shift down 100 pixels from center
  lv_scale_set_mode(tickMarks, LV_SCALE_MODE_ROUND_OUTER);
  lv_scale_set_range(tickMarks, -25, 25);
  meter_angle = 240;
  meter_angle_width = 60;
  lv_scale_set_rotation(tickMarks, meter_angle);
  lv_scale_set_angle_range(tickMarks, meter_angle_width);
  lv_scale_set_total_tick_count(tickMarks, 11); /* Major + minor ticks */
  lv_scale_set_major_tick_every(tickMarks, 1);
  lv_obj_set_style_border_width(tickMarks, 0, 0);
  lv_obj_set_style_pad_all(tickMarks, 20, 0);
  lv_obj_set_style_length(tickMarks, 10, LV_PART_ITEMS);
  lv_obj_set_style_line_width(tickMarks, 1, LV_PART_ITEMS);
  lv_obj_set_style_line_color(tickMarks, lv_color_hex(0x888888), LV_PART_ITEMS);
  lv_obj_set_style_length(tickMarks, 15, LV_PART_INDICATOR);
  lv_obj_set_style_line_width(tickMarks, 2, LV_PART_INDICATOR);
  lv_obj_set_style_line_color(tickMarks, lv_color_hex(Charcoal), LV_PART_INDICATOR);
  static const char *angle_labels[] = {"25", " ", " ", " ", " ", "0", " ", " ", " ", "", "25", NULL};
  lv_scale_set_text_src(tickMarks, angle_labels);
  lv_obj_move_background(tickMarks);

  // 3. Force render
  lv_refr_now(NULL);

  // 4. Take snapshot
  // Captures the rendered scale and its background color into the global snapshot buffer.
  snapshot = lv_snapshot_take(temp_cont, LV_COLOR_FORMAT_RGB565);

  // 5. Delete temporary container (this also deletes the resource-intensive scale object)
  lv_obj_del(temp_cont);

  // 6. Create image from snapshot and place it on the screen
  if (snapshot)

  {
    lv_obj_t *img = lv_image_create(scr);
    lv_image_set_src(img, snapshot);
    // Align image to the same position as the temporary container was, effectively full screen
    lv_obj_set_size(img, ST7789_WIDTH, ST7789_HEIGHT);
    lv_obj_align(img, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_move_background(img); // Ensure it stays behind the needle
  }
  // --- END STATIC SCALE PRE-RENDERING ---
#endif
///* Create a scale object */

// Create temporary container for rendering
// lv_obj_t *temp_cont = lv_obj_create(scr);
// lv_obj_set_size(temp_cont, 400, 400);
// lv_obj_set_style_bg_color(temp_cont, lv_color_hex(0xf0ead1), 0);
#if 0
  tickMarks = lv_scale_create(scr);
  lv_obj_clear_flag(tickMarks, LV_OBJ_FLAG_CLICKABLE);
  lv_obj_clear_flag(tickMarks, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_add_flag(tickMarks, LV_OBJ_FLAG_IGNORE_LAYOUT);
  lv_obj_set_style_line_opa(tickMarks, LV_OPA_COVER, LV_PART_ITEMS);
  lv_obj_set_style_opa(tickMarks, LV_OPA_COVER, 0);
  lv_obj_set_size(tickMarks, 400, 400);
  lv_obj_align(tickMarks, LV_ALIGN_CENTER, 0, 100); // Shift down 100 pixels from center
  lv_scale_set_mode(tickMarks, LV_SCALE_MODE_ROUND_OUTER);
  lv_scale_set_range(tickMarks, -25, 25);
  meter_angle = 240;
  meter_angle_width = 60;
  lv_scale_set_rotation(tickMarks, meter_angle);
  lv_scale_set_angle_range(tickMarks, meter_angle_width);
  lv_scale_set_total_tick_count(tickMarks, 11); /* Major + minor ticks */
  lv_scale_set_major_tick_every(tickMarks, 1);
  lv_obj_set_style_border_width(tickMarks, 0, 0);
  lv_obj_set_style_pad_all(tickMarks, 20, 0);
  lv_obj_set_style_length(tickMarks, 10, LV_PART_ITEMS);
  lv_obj_set_style_line_width(tickMarks, 1, LV_PART_ITEMS);
  lv_obj_set_style_line_color(tickMarks, lv_color_hex(0x888888), LV_PART_ITEMS);
  lv_obj_set_style_length(tickMarks, 15, LV_PART_INDICATOR);
  lv_obj_set_style_line_width(tickMarks, 2, LV_PART_INDICATOR);
  lv_obj_set_style_line_color(tickMarks, lv_color_hex(Charcoal), LV_PART_INDICATOR);
  static const char *angle_labels[] = {"25", " ", " ", " ", " ", "0", " ", " ", " ", "", "25", NULL};
  lv_scale_set_text_src(tickMarks, angle_labels);
  lv_obj_move_background(tickMarks);
#endif
#if 0
  // Force render
  lv_refr_now(NULL);

  // Take snapshot
  snapshot = lv_snapshot_take(temp_cont, LV_COLOR_FORMAT_RGB565);

  // Create image from snapshot
  lv_obj_t *img = lv_image_create(scr);
  lv_image_set_src(img, snapshot);
  lv_obj_align(img, LV_ALIGN_CENTER, 0, 100);

  // Delete temporary container (and scale)
  lv_obj_del(temp_cont);
#endif
  // lv_obj_t *tickMarkCanvas = lv_canvas_create(scr);
  // lv_canvas_set_buffer(tickMarkCanvas, tickMarkCanvasBuffer, 400, 400, LV_COLOR_FORMAT_RGB565);
  // lv_obj_update_layout(tickMarks);
  // lv_canvas_fill_bg(tickMarkCanvas, lv_color_hex(WEB_LIGHT_TAN), LV_OPA_COVER);
  //
  // lv_obj_del(tickMarks);

  /* Create a needle/indicator pointing to 0 degrees */

  // needle widget - child of root
  needle = lv_line_create(scr);

  lv_obj_clear_flag(needle, LV_OBJ_FLAG_CLICKABLE);
  lv_obj_clear_flag(needle, LV_OBJ_FLAG_SCROLLABLE);

  // init needle at origin, and origin plus length
  static lv_point_precise_t needle_points[2];
  needle_points[0].x = needleOriginX;
  needle_points[0].y = needleOriginY; // origin placed at the center of the screen
  needle_points[1].x = needleOriginX;
  needle_points[1].y = needleOriginY + needleLength;

  lv_line_set_points(needle, needle_points, 2);
  // lv_obj_align(needle, LV_ALIGN_CENTER, 0, needleLength / 2);
  lv_obj_set_style_line_width(needle, 2, 0);
  lv_obj_set_style_line_color(needle, lv_color_hex(Charcoal), 0);
  lv_obj_set_style_line_rounded(needle, true, 0);

