jaowens14/DeltaTPlus_STM32WB55RG_0925/DeltaTPlus_STM32WB55RG_090525/Core/Src/main.cpp
  lv_timer_create(updateNeedle, 15, needle);

  //
  // Create the label inside the box
  lv_obj_t *label = lv_label_create(scr);
  lv_obj_set_size(label, 240, 80);
  lv_label_set_text(label, "Delta-T Plus\n The Instrument Company\n Fort Collins, CO");
  lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0); // center text in box
  lv_obj_set_style_border_width(label, 0, 0);
  lv_obj_set_style_text_color(label, lv_color_hex(Charcoal), 0);
  lv_obj_set_style_text_font(label, &lv_font_montserrat_14, 0);
  lv_obj_align(label, LV_ALIGN_BOTTOM_MID, 0, 0);
//
// lv_obj_t *headerContainer = lv_obj_create(lv_scr_act());
// lv_obj_set_size(headerContainer, 240, 32);
// lv_obj_align(headerContainer, LV_ALIGN_TOP_MID, 0, 0);
// lv_obj_set_scrollbar_mode(headerContainer, LV_SCROLLBAR_MODE_OFF);
// lv_obj_set_style_bg_color(headerContainer, lv_color_hex(WEB_LIGHT_TAN), 0); // cream background
//
// lv_obj_set_style_radius(headerContainer, 0, 0);
//
//// Left label for switch state
// leftHeaderLabel = lv_label_create(headerContainer);
// lv_label_set_text(leftHeaderLabel, "LOW");
// lv_obj_align(leftHeaderLabel, LV_ALIGN_LEFT_MID, 0, 0);
//
//// Right label for battery
#if 1
  batteryLabel = lv_label_create(scr);
  lv_obj_clear_flag(batteryLabel, LV_OBJ_FLAG_CLICKABLE);
  lv_obj_clear_flag(batteryLabel, LV_OBJ_FLAG_SCROLLABLE);
  lv_label_set_text(batteryLabel, "100%");
  lv_obj_set_size(batteryLabel, 64, 32);
  lv_obj_align(batteryLabel, LV_ALIGN_TOP_RIGHT, 0, 5);
  lv_timer_create(updateBatteryLabel, 3000, batteryLabel);

  // lv_timer_create(updateRightHeaderLabel, 3000, rightHeaderLabel);

#endif

#if 1
  settingLabel = lv_label_create(scr);
  lv_obj_clear_flag(settingLabel, LV_OBJ_FLAG_CLICKABLE);
  lv_obj_clear_flag(settingLabel, LV_OBJ_FLAG_SCROLLABLE);
  lv_label_set_text(settingLabel, "LOW");
  lv_obj_set_size(settingLabel, 64, 32);
  lv_obj_align(settingLabel, LV_ALIGN_TOP_LEFT, 10, 5);
  lv_timer_create(updateSettingLabel, 500, settingLabel);
#endif
  // lv_timer_create(updateNeedle, 20, needle);
}

//////////////////////////////////////////////////

// main timer implementation
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{

  if (htim == &htim16)
  {
    // if(init_finished) {
    //  increment / decrement 0.1ms timers here.

    timerCounter++;

    if ((timerCounter % 10) == 0)
    {

      lv_tick_inc(1);

      if (lv_delay)
      {
        lv_delay--;
      }
    }

    if ((timerCounter % 100) == 0)
    {

      if (myTouch.delay)
      {
        myTouch.delay--;
      }

      if (myAccelerometer.readDelay)
      {
        myAccelerometer.readDelay--;
      }
    }

    if ((timerCounter % 1000) == 0)
    {
      // increment / decrement 100 ms timers here.
      // if (helloWorldDelay)
      //{
      //  helloWorldDelay--;
      //}
    }

    if ((timerCounter % 10000) == 0)
    {
      // increment / decrement 1000 ms timers here.  Note this resets the timer variable.

      loopsPerSecond = loopCounter;
      loopCounter = 0;
      measureFlag = 1; // Signal to print result

      timerCounter = 0;
      if (myAccelerometer.delay)
      {
        myAccelerometer.delay--;
      }
    }
    //}
  }
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
  if (hspi == &hspi2)
  {
    ST7789_CS_HIGH();
    lv_display_flush_ready(display1);
  }
}

// GPIO EXTI Callback - this is where you connect to the library
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{

  // Call the library's interrupt handler
  Touch_FT5436_IRQHandler(&myTouch.touch_controller, CTP_INT_Pin);
}

void my_flush_cb(lv_display_t *display, const lv_area_t *area, uint8_t *px_map)
{

  ST7789_SetWindow(area->x1, area->y1, area->x2, area->y2);

  ST7789_CS_LOW_DC_HIGH();

  int32_t width = area->x2 - area->x1 + 1;
  int32_t height = area->y2 - area->y1 + 1;

  uint32_t size = width * height * 2; // 2 bytes per pixel for RGB565

  lv_draw_sw_rgb565_swap(px_map, (area->x2 - area->x1 + 1) * (area->y2 - area->y1 + 1));

  HAL_SPI_Transmit_DMA(&hspi2, (uint8_t *)px_map, size);
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* Config code for STM32_WPAN (HSE Tuning must be done before system clock configuration) */
  MX_APPE_Config();

  /* IPCC initialisation */
  MX_IPCC_Init();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_RTC_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_SPI2_Init();
  MX_TIM2_Init();
  MX_USART1_UART_Init();
  MX_TIM16_Init();
  MX_RF_Init();
  /* USER CODE BEGIN 2 */

  // MX_APPE_Init();

  HAL_Delay(100);
  MX_USB_Device_Init();
  HAL_Delay(100);

  HAL_TIM_Base_Start_IT(&htim16);
  HAL_NVIC_SetPriority(TIM1_UP_TIM16_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(TIM1_UP_TIM16_IRQn);
  /* USER CODE END 2 */

  /* Init code for STM32_WPAN */
  MX_APPE_Init();

  myAccelerometer.setup();
  myThermocouples.setup();
  // myScreen.setup();
  myTouch.setup();
  myBacklight.setup();

  setupBatteryMonitor();

  snprintf((char *)UART_BUFFER, 64, "Setup finished\r\n");
  HAL_UART_Transmit(&huart1, UART_BUFFER, strlen((char *)UART_BUFFER), 300);

  uint32_t freq = HAL_RCC_GetSysClockFreq();
  snprintf((char *)UART_BUFFER, 64, "SYSCLK: %lu MHz\r\n", freq / 1000000);
  HAL_UART_Transmit(&huart1, UART_BUFFER, strlen((char *)UART_BUFFER), 300);

  HAL_Delay(1000);

  // 1. Initialize LVLG early lv_init
  lv_init();
  // 2. Initialize TFT Driver
  ST7789_Init();

  ST7789V_SetRotation(2);

  ST7789_FillScreen(0xf400);
  HAL_Delay(1000);
  // 3. Connect tick interface
  lv_tick_set_cb(HAL_GetTick);
  // 4. Connect display interface
  // 4.a create display
  display1 = lv_display_create(ST7789_WIDTH, ST7789_HEIGHT);

  // 4.b buffers
  lv_display_set_buffers(display1, buffer1, buffer2, sizeof(buffer1), LV_DISPLAY_RENDER_MODE_PARTIAL);
  // 4.c flush callback
  lv_display_set_flush_cb(display1, my_flush_cb);

